<?xml version="1.0"?>
<net name="Model0" version="11">
	<layers>
		<layer id="0" name="vl_embs" type="Parameter" version="opset1">
			<data shape="?,?,?" element_type="f32" />
			<output>
				<port id="0" precision="FP32" names="vl_embs">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="1" name="initial_noise" type="Parameter" version="opset1">
			<data shape="?,?,?" element_type="f32" />
			<output>
				<port id="0" precision="FP32" names="initial_noise">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="2" name="state" type="Parameter" version="opset1">
			<data shape="?,?,?" element_type="f32" />
			<output>
				<port id="0" precision="FP32" names="state">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="3" name="self.action_model.state_encoder.layer1.weight_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1024, 8" offset="0" size="16384" />
			<output>
				<port id="0" precision="FP16" names="self.action_model.state_encoder.layer1.weight">
					<dim>1024</dim>
					<dim>8</dim>
				</port>
			</output>
		</layer>
		<layer id="4" name="self.action_model.state_encoder.layer1.weight" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1024</dim>
					<dim>8</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1024</dim>
					<dim>8</dim>
				</port>
			</output>
		</layer>
		<layer id="5" name="__module.action_model.state_encoder.layer1/aten::linear/MatMul" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1024</dim>
					<dim>8</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>1024</dim>
				</port>
			</output>
		</layer>
		<layer id="6" name="Constant_110709_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 1, 1024" offset="16384" size="2048" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1024</dim>
				</port>
			</output>
		</layer>
		<layer id="7" name="Constant_110709" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1024</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1024</dim>
				</port>
			</output>
		</layer>
		<layer id="8" name="__module.action_model.state_encoder.layer1/aten::linear/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>1024</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1024</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="2021,3627,415,5233,input.1103,input.371,input.5,input.737">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>1024</dim>
				</port>
			</output>
		</layer>
		<layer id="9" name="__module.action_model.state_encoder/aten::relu/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>1024</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="2022,3628,416,5234,input.1105,input.373,input.7,input.739">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>1024</dim>
				</port>
			</output>
		</layer>
		<layer id="10" name="self.action_model.state_encoder.layer2.weight_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1536, 1024" offset="18432" size="3145728" />
			<output>
				<port id="0" precision="FP16" names="self.action_model.state_encoder.layer2.weight">
					<dim>1536</dim>
					<dim>1024</dim>
				</port>
			</output>
		</layer>
		<layer id="11" name="self.action_model.state_encoder.layer2.weight" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1536</dim>
					<dim>1024</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1536</dim>
					<dim>1024</dim>
				</port>
			</output>
		</layer>
		<layer id="12" name="__module.action_model.state_encoder.layer2/aten::linear/MatMul" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>1024</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1536</dim>
					<dim>1024</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>1536</dim>
				</port>
			</output>
		</layer>
		<layer id="13" name="Constant_110710_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 1, 1536" offset="3164160" size="3072" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1536</dim>
				</port>
			</output>
		</layer>
		<layer id="14" name="Constant_110710" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1536</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1536</dim>
				</port>
			</output>
		</layer>
		<layer id="15" name="__module.action_model.state_encoder.layer2/aten::linear/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>1536</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1536</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="2025,3631,419,5237,state_features,state_features.1,state_features.3,state_features.5">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>1536</dim>
				</port>
			</output>
		</layer>
		<layer id="16" name="aten::unsqueeze/Unsqueeze_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 32, 1536" offset="3167232" size="98304" />
			<output>
				<port id="0" precision="FP16" names="161,247,333,75">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1536</dim>
				</port>
			</output>
		</layer>
		<layer id="17" name="aten::unsqueeze/Unsqueeze" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1536</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1536</dim>
				</port>
			</output>
		</layer>
		<layer id="18" name="ShapeOf_116160" type="ShapeOf" version="opset3">
			<data output_type="i64" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="19" name="Constant_116161" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="3265536" size="8" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="20" name="Constant_116162" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="3265536" size="8" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="21" name="Gather_116163" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64" />
			</input>
			<output>
				<port id="3" precision="I64" names="1082,1171,1260,1349,1438,1527,1616,163,165,1705,1794,18,1883,20,21,2154,22,2243,23,2332,2421,249,251,2510,2599,2688,2777,2866,2955,3044,3133,3222,3311,335,337,3400,3489,3760,3849,3938,4027,4116,4205,4294,4383,4472,4561,4650,4739,4828,4917,5006,5095,5366,5455,548,5544,5633,5722,5811,5900,5989,6078,6167,6256,6345,637,6434,6523,6612,6701,726,77,79,815,904,993">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="22" name="Constant_84897" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="3265544" size="8" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="23" name="Constant_84899" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="3265544" size="8" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="24" name="prim::ListConstruct/SequenceMark" type="Concat" version="opset1">
			<data axis="0" />
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="25" name="aten::expand/Broadcast" type="Broadcast" version="opset3">
			<data mode="bidirectional" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1536</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="170,256,342,84,future_tokens.1,future_tokens.3,future_tokens.5,future_tokens.7">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>1536</dim>
				</port>
			</output>
		</layer>
		<layer id="26" name="self.action_model.action_encoder.layer1.weight_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1536, 7" offset="3265552" size="21504" />
			<output>
				<port id="0" precision="FP16" names="self.action_model.action_encoder.layer1.weight">
					<dim>1536</dim>
					<dim>7</dim>
				</port>
			</output>
		</layer>
		<layer id="27" name="self.action_model.action_encoder.layer1.weight" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1536</dim>
					<dim>7</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1536</dim>
					<dim>7</dim>
				</port>
			</output>
		</layer>
		<layer id="28" name="__module.action_model.action_encoder.layer1/aten::linear/MatMul" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1536</dim>
					<dim>7</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>1536</dim>
				</port>
			</output>
		</layer>
		<layer id="29" name="Constant_110711_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 1, 1536" offset="3287056" size="3072" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1536</dim>
				</port>
			</output>
		</layer>
		<layer id="30" name="Constant_110711" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1536</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1536</dim>
				</port>
			</output>
		</layer>
		<layer id="31" name="__module.action_model.action_encoder.layer1/aten::linear/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>1536</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1536</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="384,a_emb.1">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>1536</dim>
				</port>
			</output>
		</layer>
		<layer id="32" name="aten::full/Convert_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="" offset="3290128" size="2" />
			<output>
				<port id="0" precision="FP16" />
			</output>
		</layer>
		<layer id="33" name="aten::full/Convert" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16" />
			</input>
			<output>
				<port id="1" precision="FP32" />
			</output>
		</layer>
		<layer id="34" name="aten::full/Broadcast" type="Broadcast" version="opset3">
			<data mode="numpy" />
			<input>
				<port id="0" precision="FP32" />
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="30,35,t.1">
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="35" name="36" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="3265544" size="8" />
			<output>
				<port id="0" precision="I64" names="36" />
			</output>
		</layer>
		<layer id="36" name="aten::unsqueeze/Unsqueeze_1" type="Unsqueeze" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
				</port>
				<port id="1" precision="I64" />
			</input>
			<output>
				<port id="2" precision="FP32" names="37">
					<dim>-1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="37" name="38" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="3290130" size="8" />
			<output>
				<port id="0" precision="I64" names="38" />
			</output>
		</layer>
		<layer id="38" name="aten::unsqueeze/Unsqueeze_2" type="Unsqueeze" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="I64" />
			</input>
			<output>
				<port id="2" precision="FP32" names="39,44,t.3">
					<dim>-1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="39" name="46" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="3265536" size="8" />
			<output>
				<port id="0" precision="I64" names="46" />
			</output>
		</layer>
		<layer id="40" name="45" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="3265544" size="8" />
			<output>
				<port id="0" precision="I64" names="45" />
			</output>
		</layer>
		<layer id="41" name="aten::select/Gather" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="I64" />
				<port id="2" precision="I64" />
			</input>
			<output>
				<port id="3" precision="FP32" names="47">
					<dim>-1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="42" name="49" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="3265536" size="8" />
			<output>
				<port id="0" precision="I64" names="49" />
			</output>
		</layer>
		<layer id="43" name="48" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="3265544" size="8" />
			<output>
				<port id="0" precision="I64" names="48" />
			</output>
		</layer>
		<layer id="44" name="aten::select/Gather_1" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="I64" />
				<port id="2" precision="I64" />
			</input>
			<output>
				<port id="3" precision="FP32" names="50">
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="45" name="Constant_110712_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1" offset="3290138" size="2" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="46" name="Constant_110712" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="47" name="aten::mul/Multiply" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="52">
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="48" name="aten::to/Convert" type="Convert" version="opset1">
			<data destination_type="i64" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64" names="489,57,timesteps.1">
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="49" name="374" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="3265544" size="8" />
			<output>
				<port id="0" precision="I64" names="374" />
			</output>
		</layer>
		<layer id="50" name="__module.action_model.action_encoder/aten::unsqueeze/Unsqueeze" type="Unsqueeze" version="opset1">
			<input>
				<port id="0" precision="I64">
					<dim>-1</dim>
				</port>
				<port id="1" precision="I64" />
			</input>
			<output>
				<port id="2" precision="I64" names="379,490">
					<dim>-1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="51" name="Constant_84904" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="3265544" size="8" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="52" name="ShapeOf_116166" type="ShapeOf" version="opset3">
			<data output_type="i64" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="53" name="Constant_116167" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="3265544" size="8" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="54" name="Constant_116168" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="3265536" size="8" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="55" name="Gather_116169" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
				<port id="1" precision="I64" />
				<port id="2" precision="I64" />
			</input>
			<output>
				<port id="3" precision="I64" names="378,61,93" />
			</output>
		</layer>
		<layer id="56" name="Constant_116170" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="3265544" size="8" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="57" name="Reshape_116171" type="Reshape" version="opset1">
			<data special_zero="false" />
			<input>
				<port id="0" precision="I64" />
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="58" name="__module.action_model.action_encoder/prim::ListConstruct/SequenceMark" type="Concat" version="opset1">
			<data axis="0" />
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="59" name="__module.action_model.action_encoder/aten::expand/Broadcast" type="Broadcast" version="opset3">
			<data mode="bidirectional" />
			<input>
				<port id="0" precision="I64">
					<dim>-1</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="381,timesteps.3">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="60" name="__module.action_model.action_encoder.pos_encoding/aten::to/Convert" type="Convert" version="opset1">
			<data destination_type="f32" />
			<input>
				<port id="0" precision="I64">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="385,timesteps.5">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="61" name="373" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="3290140" size="8" />
			<output>
				<port id="0" precision="I64" names="373" />
			</output>
		</layer>
		<layer id="62" name="__module.action_model.action_encoder.pos_encoding/aten::unsqueeze/Unsqueeze" type="Unsqueeze" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="I64" />
			</input>
			<output>
				<port id="2" precision="FP32" names="393">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="63" name="__module.action_model.action_encoder.pos_encoding/aten::neg/Constant" type="Const" version="opset1">
			<data element_type="i32" shape="" offset="3290148" size="4" />
			<output>
				<port id="0" precision="I32" />
			</output>
		</layer>
		<layer id="64" name="__module.action_model.action_encoder.pos_encoding/aten::neg/ConvertLike" type="Convert" version="opset1">
			<data destination_type="f32" />
			<input>
				<port id="0" precision="I32" />
			</input>
			<output>
				<port id="1" precision="FP32" />
			</output>
		</layer>
		<layer id="65" name="Constant_109713_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="768" offset="3290152" size="1536" />
			<output>
				<port id="0" precision="FP16">
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="66" name="Constant_109713" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>768</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="67" name="__module.action_model.action_encoder.pos_encoding/aten::mul/Multiply" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32" />
				<port id="1" precision="FP32">
					<dim>768</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="392,exponent.1">
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="68" name="__module.action_model.action_encoder.pos_encoding/aten::exp/Exp" type="Exp" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>768</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="394">
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="69" name="__module.action_model.action_encoder.pos_encoding/aten::mul/Multiply_1" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>768</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="395,freqs.1">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="70" name="__module.action_model.action_encoder.pos_encoding/aten::sin/Sin" type="Sin" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>768</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="396,sin.1">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="71" name="__module.action_model.action_encoder.pos_encoding/aten::cos/Cos" type="Cos" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>768</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="397,cos.1">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="72" name="__module.action_model.action_encoder/aten::cat/Concat" type="Concat" version="opset1">
			<data axis="-1" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>1536</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>768</dim>
				</port>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>768</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="FP32" names="402,input.1">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>3072</dim>
				</port>
			</output>
		</layer>
		<layer id="73" name="self.action_model.action_encoder.layer2.weight_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1536, 3072" offset="3291688" size="9437184" />
			<output>
				<port id="0" precision="FP16" names="self.action_model.action_encoder.layer2.weight">
					<dim>1536</dim>
					<dim>3072</dim>
				</port>
			</output>
		</layer>
		<layer id="74" name="self.action_model.action_encoder.layer2.weight" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1536</dim>
					<dim>3072</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1536</dim>
					<dim>3072</dim>
				</port>
			</output>
		</layer>
		<layer id="75" name="__module.action_model.action_encoder.layer2/aten::linear/MatMul" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>3072</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1536</dim>
					<dim>3072</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>1536</dim>
				</port>
			</output>
		</layer>
		<layer id="76" name="Constant_110713_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 1, 1536" offset="12728872" size="3072" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1536</dim>
				</port>
			</output>
		</layer>
		<layer id="77" name="Constant_110713" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1536</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1536</dim>
				</port>
			</output>
		</layer>
		<layer id="78" name="__module.action_model.action_encoder.layer2/aten::linear/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>1536</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1536</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="405,x.1">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>1536</dim>
				</port>
			</output>
		</layer>
		<layer id="79" name="__module.action_model.action_encoder/aten::mul/Multiply" type="Swish" version="opset4">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>1536</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="407,input.3">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>1536</dim>
				</port>
			</output>
		</layer>
		<layer id="80" name="self.action_model.action_encoder.layer3.weight_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1536, 1536" offset="12731944" size="4718592" />
			<output>
				<port id="0" precision="FP16" names="self.action_model.action_encoder.layer3.weight">
					<dim>1536</dim>
					<dim>1536</dim>
				</port>
			</output>
		</layer>
		<layer id="81" name="self.action_model.action_encoder.layer3.weight" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1536</dim>
					<dim>1536</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1536</dim>
					<dim>1536</dim>
				</port>
			</output>
		</layer>
		<layer id="82" name="__module.action_model.action_encoder.layer3/aten::linear/MatMul" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>1536</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1536</dim>
					<dim>1536</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>1536</dim>
				</port>
			</output>
		</layer>
		<layer id="83" name="Constant_110714_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 1, 1536" offset="17450536" size="3072" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1536</dim>
				</port>
			</output>
		</layer>
		<layer id="84" name="Constant_110714" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1536</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1536</dim>
				</port>
			</output>
		</layer>
		<layer id="85" name="__module.action_model.action_encoder.layer3/aten::linear/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>1536</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1536</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="410,action_features.1">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>1536</dim>
				</port>
			</output>
		</layer>
		<layer id="86" name="self.action_model.position_embedding.weight_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1024, 1536" offset="17453608" size="3145728" />
			<output>
				<port id="0" precision="FP16" names="self.action_model.position_embedding.weight">
					<dim>1024</dim>
					<dim>1536</dim>
				</port>
			</output>
		</layer>
		<layer id="87" name="self.action_model.position_embedding.weight" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1024</dim>
					<dim>1536</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1024</dim>
					<dim>1536</dim>
				</port>
			</output>
		</layer>
		<layer id="88" name="aten::arange/Constant" type="Const" version="opset1">
			<data element_type="i32" shape="" offset="20599336" size="4" />
			<output>
				<port id="0" precision="I32" />
			</output>
		</layer>
		<layer id="89" name="aten::arange/Constant_1" type="Const" version="opset1">
			<data element_type="i32" shape="" offset="20599340" size="4" />
			<output>
				<port id="0" precision="I32" />
			</output>
		</layer>
		<layer id="90" name="aten::arange/Range" type="Range" version="opset4">
			<data output_type="i64" />
			<input>
				<port id="0" precision="I32" />
				<port id="1" precision="I64" />
				<port id="2" precision="I32" />
			</input>
			<output>
				<port id="3" precision="I64" names="68,input.9">
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="91" name="__module.action_model.position_embedding/aten::embedding/Convert" type="Convert" version="opset1">
			<data destination_type="i32" />
			<input>
				<port id="0" precision="I64">
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I32">
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="92" name="__module.action_model.position_embedding/aten::embedding/Constant" type="Const" version="opset1">
			<data element_type="i32" shape="" offset="20599336" size="4" />
			<output>
				<port id="0" precision="I32" />
			</output>
		</layer>
		<layer id="93" name="__module.action_model.position_embedding/aten::embedding/Gather" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="FP32">
					<dim>1024</dim>
					<dim>1536</dim>
				</port>
				<port id="1" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="2" precision="I32" />
			</input>
			<output>
				<port id="3" precision="FP32" names="423">
					<dim>-1</dim>
					<dim>1536</dim>
				</port>
			</output>
		</layer>
		<layer id="94" name="70" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="3265536" size="8" />
			<output>
				<port id="0" precision="I64" names="70" />
			</output>
		</layer>
		<layer id="95" name="aten::unsqueeze/Unsqueeze_3" type="Unsqueeze" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>1536</dim>
				</port>
				<port id="1" precision="I64" />
			</input>
			<output>
				<port id="2" precision="FP32" names="71,pos_embs.1">
					<dim>1</dim>
					<dim>-1</dim>
					<dim>1536</dim>
				</port>
			</output>
		</layer>
		<layer id="96" name="aten::add/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>1536</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>-1</dim>
					<dim>1536</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="73,action_features.3">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>1536</dim>
				</port>
			</output>
		</layer>
		<layer id="97" name="aten::cat/Concat" type="Concat" version="opset1">
			<data axis="1" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>1536</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>1536</dim>
				</port>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>1536</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="FP32" names="87,hidden_states.1">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>1536</dim>
				</port>
			</output>
		</layer>
		<layer id="98" name="__module.action_model.model.transformer_blocks.0.norm1.norm/aten::layer_norm/Multiply" type="Const" version="opset1">
			<data element_type="i32" shape="1" offset="3290148" size="4" />
			<output>
				<port id="0" precision="I32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="99" name="__module.action_model.model.transformer_blocks.0.norm1.norm/aten::layer_norm/MVN" type="MVN" version="opset6">
			<data eps="9.9999997473787516e-06" normalize_variance="true" eps_mode="INSIDE_SQRT" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>1536</dim>
				</port>
				<port id="1" precision="I32">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="535">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>1536</dim>
				</port>
			</output>
		</layer>
		<layer id="100" name="__module.action_model.model.timestep_encoder.time_proj/aten::to/Convert" type="Convert" version="opset1">
			<data destination_type="f32" />
			<input>
				<port id="0" precision="I64">
					<dim>-1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="491">
					<dim>-1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="101" name="__module.action_model.model.timestep_encoder.time_proj/aten::slice/Slice_1_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 128" offset="20599344" size="256" />
			<output>
				<port id="0" precision="FP16" names="493">
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="102" name="__module.action_model.model.timestep_encoder.time_proj/aten::slice/Slice_1" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="103" name="__module.action_model.model.timestep_encoder.time_proj/aten::mul/Multiply_1" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="494,495,emb.3,emb.5">
					<dim>-1</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="104" name="__module.action_model.model.timestep_encoder.time_proj/aten::sin/Sin" type="Sin" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="496">
					<dim>-1</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="105" name="__module.action_model.model.timestep_encoder.time_proj/aten::cos/Cos" type="Cos" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="497">
					<dim>-1</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="106" name="__module.action_model.model.timestep_encoder.time_proj/aten::cat/Concat" type="Concat" version="opset1">
			<data axis="-1" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="499,500,502,emb.7">
					<dim>-1</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="107" name="Constant_443" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="20599600" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="108" name="Constant_445" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="20599608" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="109" name="Constant_447" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="3265544" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="110" name="Constant_441" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="3265544" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="111" name="__module.action_model.model.timestep_encoder.time_proj/aten::slice/Slice_3" type="Slice" version="opset8">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>256</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64">
					<dim>1</dim>
				</port>
				<port id="3" precision="I64">
					<dim>1</dim>
				</port>
				<port id="4" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="5" precision="FP32" names="501">
					<dim>-1</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="112" name="Constant_463" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="3265536" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="113" name="Constant_465" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="20599600" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="114" name="Constant_467" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="3265544" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="115" name="Constant_461" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="3265544" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="116" name="__module.action_model.model.timestep_encoder.time_proj/aten::slice/Slice_5" type="Slice" version="opset8">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>256</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64">
					<dim>1</dim>
				</port>
				<port id="3" precision="I64">
					<dim>1</dim>
				</port>
				<port id="4" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="5" precision="FP32" names="503">
					<dim>-1</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="117" name="__module.action_model.model.timestep_encoder.time_proj/aten::cat/Concat_1" type="Concat" version="opset1">
			<data axis="-1" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="505,506,input.11">
					<dim>-1</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="118" name="self.action_model.model.timestep_encoder.timestep_embedder.linear_1.weight_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1536, 256" offset="20599616" size="786432" />
			<output>
				<port id="0" precision="FP16" names="self.action_model.model.timestep_encoder.timestep_embedder.linear_1.weight">
					<dim>1536</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="119" name="self.action_model.model.timestep_encoder.timestep_embedder.linear_1.weight" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1536</dim>
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1536</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="120" name="__module.action_model.model.timestep_encoder.timestep_embedder.linear_1/aten::linear/MatMul" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>256</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1536</dim>
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>1536</dim>
				</port>
			</output>
		</layer>
		<layer id="121" name="Constant_110715_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 1536" offset="21386048" size="3072" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1536</dim>
				</port>
			</output>
		</layer>
		<layer id="122" name="Constant_110715" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1536</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1536</dim>
				</port>
			</output>
		</layer>
		<layer id="123" name="__module.action_model.model.timestep_encoder.timestep_embedder.linear_1/aten::linear/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>1536</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1536</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="512,input.13">
					<dim>-1</dim>
					<dim>1536</dim>
				</port>
			</output>
		</layer>
		<layer id="124" name="__module.action_model.model.timestep_encoder.timestep_embedder.act/aten::silu/Swish" type="Swish" version="opset4">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>1536</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="513,input.15">
					<dim>-1</dim>
					<dim>1536</dim>
				</port>
			</output>
		</layer>
		<layer id="125" name="self.action_model.model.timestep_encoder.timestep_embedder.linear_2.weight_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1536, 1536" offset="21389120" size="4718592" />
			<output>
				<port id="0" precision="FP16" names="self.action_model.model.timestep_encoder.timestep_embedder.linear_2.weight">
					<dim>1536</dim>
					<dim>1536</dim>
				</port>
			</output>
		</layer>
		<layer id="126" name="self.action_model.model.timestep_encoder.timestep_embedder.linear_2.weight" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1536</dim>
					<dim>1536</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1536</dim>
					<dim>1536</dim>
				</port>
			</output>
		</layer>
		<layer id="127" name="__module.action_model.model.timestep_encoder.timestep_embedder.linear_2/aten::linear/MatMul" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>1536</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1536</dim>
					<dim>1536</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>1536</dim>
				</port>
			</output>
		</layer>
		<layer id="128" name="Constant_110716_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 1536" offset="26107712" size="3072" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1536</dim>
				</port>
			</output>
		</layer>
		<layer id="129" name="Constant_110716" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1536</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1536</dim>
				</port>
			</output>
		</layer>
		<layer id="130" name="__module.action_model.model.timestep_encoder.timestep_embedder.linear_2/aten::linear/Add" type="Add" version="opset1">
