<?xml version="1.0"?>
<net name="Model0" version="11">
	<layers>
		<layer id="0" name="input_ids" type="Parameter" version="opset1">
			<data shape="?,?" element_type="i64" />
			<output>
				<port id="0" precision="I64" names="input_ids">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="1" name="attention_mask" type="Parameter" version="opset1">
			<data shape="?,?" element_type="i64" />
			<output>
				<port id="0" precision="I64" names="attention_mask">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="2" name="pixel_values" type="Parameter" version="opset1">
			<data shape="?,?,?,?" element_type="f32" />
			<output>
				<port id="0" precision="FP32" names="pixel_values">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="3" name="image_grid_thw" type="Parameter" version="opset1">
			<data shape="?,?" element_type="i64" />
			<output>
				<port id="0" precision="I64" names="image_grid_thw">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="4" name="__module.model/aten::randn/Convert" type="Const" version="opset1">
			<data element_type="i32" shape="3" offset="0" size="12" />
			<output>
				<port id="0" precision="I32">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="5" name="__module.model/aten::randn/Constant_1" type="Const" version="opset1">
			<data element_type="f32" shape="1" offset="12" size="4" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="6" name="__module.model/aten::randn/Constant_2_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1" offset="16" size="2" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="7" name="__module.model/aten::randn/Constant_2" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="8" name="__module.model/aten::randn/RandomUniform" type="RandomUniform" version="opset8">
			<data output_type="f32" op_seed="1174483603" global_seed="0" alignment="tensorflow" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="I32">
					<dim>3</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
				</port>
				<port id="2" precision="FP32">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>2048</dim>
				</port>
			</output>
		</layer>
		<layer id="9" name="__module.model/aten::randn/Log" type="Log" version="opset1">
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>2048</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>2048</dim>
				</port>
			</output>
		</layer>
		<layer id="10" name="Constant_2402_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 1, 1" offset="18" size="2" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="11" name="Constant_2402" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="12" name="__module.model/aten::randn/Multiply" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>2048</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>2048</dim>
				</port>
			</output>
		</layer>
		<layer id="13" name="__module.model/aten::randn/Sqrt" type="Sqrt" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>2048</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>2048</dim>
				</port>
			</output>
		</layer>
		<layer id="14" name="Constant_2086" type="Const" version="opset1">
			<data element_type="f32" shape="1" offset="20" size="4" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="15" name="Constant_2087" type="Const" version="opset1">
			<data element_type="f32" shape="1" offset="24" size="4" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="16" name="__module.model/aten::randn/Multiply_2" type="RandomUniform" version="opset8">
			<data output_type="f32" op_seed="1174493603" global_seed="0" alignment="tensorflow" />
			<input>
				<port id="0" precision="I32">
					<dim>3</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
				</port>
				<port id="2" precision="FP32">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>2048</dim>
				</port>
			</output>
		</layer>
		<layer id="17" name="__module.model/aten::randn/Cos" type="Cos" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>2048</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>2048</dim>
				</port>
			</output>
		</layer>
		<layer id="18" name="__module.model/aten::randn/Add" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>2048</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>2048</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>2048</dim>
				</port>
			</output>
		</layer>
		<layer id="19" name="Result_46" type="Result" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>2048</dim>
				</port>
			</input>
		</layer>
	</layers>
	<edges>
		<edge from-layer="4" from-port="0" to-layer="8" to-port="0" />
		<edge from-layer="4" from-port="0" to-layer="16" to-port="0" />
		<edge from-layer="5" from-port="0" to-layer="8" to-port="1" />
		<edge from-layer="6" from-port="0" to-layer="7" to-port="0" />
		<edge from-layer="7" from-port="1" to-layer="8" to-port="2" />
		<edge from-layer="8" from-port="3" to-layer="9" to-port="0" />
		<edge from-layer="9" from-port="1" to-layer="12" to-port="0" />
		<edge from-layer="10" from-port="0" to-layer="11" to-port="0" />
		<edge from-layer="11" from-port="1" to-layer="12" to-port="1" />
		<edge from-layer="12" from-port="2" to-layer="13" to-port="0" />
		<edge from-layer="13" from-port="1" to-layer="18" to-port="0" />
		<edge from-layer="14" from-port="0" to-layer="16" to-port="1" />
		<edge from-layer="15" from-port="0" to-layer="16" to-port="2" />
		<edge from-layer="16" from-port="3" to-layer="17" to-port="0" />
		<edge from-layer="17" from-port="1" to-layer="18" to-port="1" />
		<edge from-layer="18" from-port="2" to-layer="19" to-port="0" />
	</edges>
	<rt_info>
		<Runtime_version value="2026.1.0-21367-63e31528c62-releases/2026/1" />
		<conversion_parameters>
			<framework value="pytorch" />
			<is_python_object value="True" />
		</conversion_parameters>
	</rt_info>
</net>
